Practica 4/datos/Ab/haproxy_ab_9.txt
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.142 (be patient)


Server Software:        Apache/2.4.18
Server Hostname:        192.168.1.142
Server Port:            80

Document Path:          /hola.html
Document Length:        62 bytes

Concurrency Level:      5
Time taken for tests:   3.683 seconds
Complete requests:      10000
Failed requests:        5000
   (Connect: 0, Receive: 0, Length: 5000, Exceptions: 0)
Total transferred:      3090000 bytes
HTML transferred:       630000 bytes
Requests per second:    2714.84 [#/sec] (mean)
Time per request:       1.842 [ms] (mean)
Time per request:       0.368 [ms] (mean, across all concurrent requests)
Transfer rate:          819.22 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       4
Processing:     1    2   0.4      2       8
Waiting:        1    2   0.4      2       8
Total:          1    2   0.4      2       8

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      2
  75%      2
  80%      2
  90%      2
  95%      3
  98%      3
  99%      3
 100%      8 (longest request)